---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SketchBase
source: html/b4de260a-5239-0a39-414c-cf286d5f97a1.htm
---
# SketchBase Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.